Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/criminal_legal_aid.html.txt.tmx
Source language: en
Languages: ga

source: To apply for funding approval you must apply to the court which is dealing with your case
ga: Chun iarratas a chur isteach ar mhaoiniú, ní mór duit iarratas a chur isteach chuig an chúirt atá freagrach as do chás a phlé

source: The court decides the level of legal representation and/or witness expenses allowed
ga: Is í an chúirt a leagann amach an leibhéal ionadaíochta dlí agus/nó an méid airgid a fhaigheann finnéithe

source: Further information on the scheme is available on the Department of Justice and Equality’s website
ga: Tá tuilleadh eolais ar an scéim ar fáil ar an láithreán gréasáin de na Roinn Dlí agus Cirt agus Comhionannais
